Terraform changes from this PR:
-------------------------------

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.whats-the-word will be created
  + resource "google_cloud_run_service" "whats-the-word" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-east1"
      + name                       = "whats-the-word"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "foo" = "baz"
            }
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/stanke-dev/whats-the-word"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_cloud_run_service_iam_binding.noauth will be created
  + resource "google_cloud_run_service_iam_binding" "noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-east1"
      + members  = [
          + "allUsers",
        ]
      + project  = "stanke-dev"
      + role     = "roles/run.invoker"
      + service  = "whats-the-word"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud_run_endpoint = (known after apply)
